microchip-pic-avr-examples/llc50w-power-voltage-mode-control-with-active-current-sharing/dspic33c-illc.X/mcc_generated_files/adc1.h
inline static void ADC1_SoftwareTriggerEnable(void)
{
   ADCON3Lbits.SWCTRG = 1;
}

/**
  @Summary
    Disables software common trigger.

  @Description
    This routine is used to disable the ADC1 software common trigger.
 
  @Preconditions
    ADC1_Initialize function should have been called 
    before calling this function.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
*/
inline static void ADC1_SoftwareTriggerDisable(void)
{
   ADCON3Lbits.SWCTRG = 0;
}

/**
  @Summary
    Allows selection of a channel for conversion.

  @Description
    This routine is used to select desired channel for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.

  @Param
    channel - Channel for conversion

  @Returns
    None
  
  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
*/
inline static void ADC1_ChannelSelect( ADC1_CHANNEL channel )
{
    /*This routine does not have any implementation since 
            *Shared channels are selected from UI.
            *Dedicated channels are selected from UI.
    */
}

/**
  @Summary
    Returns the conversion value for the channel selected.

  @Description
    This routine is used to get the analog to digital converted value for a 
    specific channel.
 
  @Preconditions
    This routine returns the conversion value only after the conversion is complete. 
    Conversion completion status can be checked using ADC1_IsConversionComplete(channel)
    routine.

  @Param
    channel - Selected channel
   
  @Returns
   Returns the analog to digital converted value
  
  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
 */
inline static uint16_t ADC1_ConversionResultGet( ADC1_CHANNEL channel )
{
    uint16_t result;

    switch(channel)
    {
        case FB_VAUX:
                result = ADCBUF6;
                break;
        case FB_VOUT:
                result = ADCBUF12;
                break;
        case FB_TEMP:
                result = ADCBUF14;
                break;
        case channel_AN15:
                result = ADCBUF15;
                break;
        case FB_P_CT2_FLT:
                result = ADCBUF17;
                break;
        case FB_P_CT1_FLT:
                result = ADCBUF19;
                break;
        case FB_S_CT1_FLT:
                result = ADCBUF0;
                break;
        case FB_S_CT2_FLT:
                result = ADCBUF1;
                break;
        default:
                break;
    }
    return result;
}

/**
  @Summary
    Returns the status of conversion.

  @Description
    This routine is used to determine if conversion is completed. When conversion
    is complete the routine returns true otherwise false.
 
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.

  @Param
    channel - Selected channel
 
  @Returns
    true - Conversion is complete.
    false - Conversion is not complete.
  
  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
 */
inline static bool ADC1_IsConversionComplete(ADC1_CHANNEL channel)
{
    bool status;

    switch(channel)
    {
        case FB_VAUX:
                status = ADSTATLbits.AN6RDY;
                break;
        case FB_VOUT:
                status = ADSTATLbits.AN12RDY;
                break;
        case FB_TEMP:
                status = ADSTATLbits.AN14RDY;
                break;
        case channel_AN15:
                status = ADSTATLbits.AN15RDY;
                break;
        case FB_P_CT2_FLT:
                status = ADSTATHbits.AN17RDY;
                break;
        case FB_P_CT1_FLT:
                status = ADSTATHbits.AN19RDY;
                break;
        case FB_S_CT1_FLT:
                status = ADSTATLbits.AN0RDY;
                break;
        case FB_S_CT2_FLT:
                status = ADSTATLbits.AN1RDY;
                break;
        default:
                break;
    }

    return status;
}

/**
  @Summary
    Enables interrupts.

  @Description
    This routine is used to enable the ADC1 interrupt.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptEnable(); 
    </code>
*/
inline static void ADC1_InterruptEnable(void)
{
    IEC5bits.ADCIE = 1;
}

/**
  @Summary
    Disables interrupts.

  @Description
    This routine is used to disable the ADC1 interrupt.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptDisable(); 
    </code>
*/
inline static void ADC1_InterruptDisable(void)
{
    IEC5bits.ADCIE = 0;
}

/**
  @Summary
    Clears interrupt flag

  @Description
    This routine is used to clear the interrupt flag manually.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptFlagClear(); 
    </code>
*/
inline static void ADC1_InterruptFlagClear(void)
{
    IFS5bits.ADCIF = 0;
}

/**
  @Summary
    Allows selection of priority for interrupt.

  @Description
    This routine is used to select desired priority for interrupt.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        uint16_t priorityValue;
        priorityValue = 0x002;
 
        ADC1_InterruptPrioritySet(priorityValue); 
    </code>
*/
inline static void ADC1_InterruptPrioritySet( uint16_t priorityValue )
{
    IPC22bits.ADCIP = 0x7 & priorityValue;
}

/**
  @Summary
    ADC1 Common callback routine.

  @Description
    This routine is a ADC1 Common callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCommonInterruptHandler(&ADC1_CallBack);
    </code>
*/
void ADC1_CallBack(void);

/**
  @Summary
    Assigns a function pointer with a ADC1 Common callback address.

  @Description
    This routine assigns a function pointer with a ADC1 Common callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCommonInterruptHandler(&ADC1_CallBack);
    </code>
*/
void ADC1_SetCommonInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_Tasks();
    </code>
*/
void ADC1_Tasks(void);

/**
  @Summary
    Enables individual channel interrupt.

  @Description
    This routine is used to enable the ADC1 individual channel
    interrupt.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptEnable(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptEnable(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case FB_VAUX:
                IEC6bits.ADCAN6IE = 1;
                break;
        case FB_VOUT:
                IEC6bits.ADCAN12IE = 1;
                break;
        case FB_TEMP:
                IEC6bits.ADCAN14IE = 1;
                break;
        case channel_AN15:
                IEC6bits.ADCAN15IE = 1;
                break;
        case FB_P_CT2_FLT:
                IEC6bits.ADCAN17IE = 1;
                break;
        case FB_P_CT1_FLT:
                IEC6bits.ADCAN19IE = 1;
                break;
        case FB_S_CT1_FLT:
                IEC5bits.ADCAN0IE = 1;
                break;
        case FB_S_CT2_FLT:
                IEC5bits.ADCAN1IE = 1;
                break;
        default:
                break;
    }
}

/**
  @Summary
    Disables individual channel interrupt.

  @Description
    This routine is used to disable the ADC1 individual channel
    interrupt.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptDisable(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptDisable(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case FB_VAUX:
                IEC6bits.ADCAN6IE = 0;
                break;
        case FB_VOUT:
                IEC6bits.ADCAN12IE = 0;
                break;
        case FB_TEMP:
                IEC6bits.ADCAN14IE = 0;
                break;
        case channel_AN15:
                IEC6bits.ADCAN15IE = 0;
                break;
        case FB_P_CT2_FLT:
                IEC6bits.ADCAN17IE = 0;
                break;
        case FB_P_CT1_FLT:
                IEC6bits.ADCAN19IE = 0;
                break;
        case FB_S_CT1_FLT:
                IEC5bits.ADCAN0IE = 0;
                break;
        case FB_S_CT2_FLT:
                IEC5bits.ADCAN1IE = 0;
                break;
        default:
                break;
    }
}

/**
  @Summary
    Clears individual channel interrupt flag

  @Description
    This routine is used to clear the individual channel interrupt flag manually.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptFlagClear(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptFlagClear(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case FB_VAUX:
                IFS6bits.ADCAN6IF = 0;
                break;
        case FB_VOUT:
                IFS6bits.ADCAN12IF = 0;
                break;
        case FB_TEMP:
                IFS6bits.ADCAN14IF = 0;
                break;
        case channel_AN15:
                IFS6bits.ADCAN15IF = 0;
                break;
        case FB_P_CT2_FLT:
                IFS6bits.ADCAN17IF = 0;
                break;
        case FB_P_CT1_FLT:
                IFS6bits.ADCAN19IF = 0;
                break;
        case FB_S_CT1_FLT:
                IFS5bits.ADCAN0IF = 0;
                break;
        case FB_S_CT2_FLT:
                IFS5bits.ADCAN1IF = 0;
                break;
        default:
                break;
    }
}

/**
  @Summary
    ADC1 FB_VAUX callback routine.

  @Description
    This routine is a ADC1 FB_VAUX callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_VAUXInterruptHandler(&ADC1_FB_VAUX_CallBack);
    </code>
*/
void ADC1_FB_VAUX_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 FB_VAUX callback address.

  @Description
    This routine assigns a function pointer with a ADC1 FB_VAUX callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_VAUXInterruptHandler(&ADC1_FB_VAUX_CallBack);
    </code>
*/
void ADC1_SetFB_VAUXInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 FB_VAUX polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_FB_VAUX_Tasks();
    </code>
*/
void ADC1_FB_VAUX_Tasks(void);

/**
  @Summary
    ADC1 FB_VOUT callback routine.

  @Description
    This routine is a ADC1 FB_VOUT callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_VOUTInterruptHandler(&ADC1_FB_VOUT_CallBack);
    </code>
*/
void ADC1_FB_VOUT_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 FB_VOUT callback address.

  @Description
    This routine assigns a function pointer with a ADC1 FB_VOUT callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_VOUTInterruptHandler(&ADC1_FB_VOUT_CallBack);
    </code>
*/
void ADC1_SetFB_VOUTInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 FB_VOUT polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_FB_VOUT_Tasks();
    </code>
*/
void ADC1_FB_VOUT_Tasks(void);

/**
  @Summary
    ADC1 FB_TEMP callback routine.

  @Description
    This routine is a ADC1 FB_TEMP callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_TEMPInterruptHandler(&ADC1_FB_TEMP_CallBack);
    </code>
*/
void ADC1_FB_TEMP_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 FB_TEMP callback address.

  @Description
    This routine assigns a function pointer with a ADC1 FB_TEMP callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_TEMPInterruptHandler(&ADC1_FB_TEMP_CallBack);
    </code>
*/
void ADC1_SetFB_TEMPInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 FB_TEMP polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_FB_TEMP_Tasks();
    </code>
*/
void ADC1_FB_TEMP_Tasks(void);

/**
  @Summary
    ADC1 channel_AN15 callback routine.

  @Description
    This routine is a ADC1 channel_AN15 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN15InterruptHandler(&ADC1_channel_AN15_CallBack);
    </code>
*/
void ADC1_channel_AN15_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 channel_AN15 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 channel_AN15 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN15InterruptHandler(&ADC1_channel_AN15_CallBack);
    </code>
*/
void ADC1_Setchannel_AN15InterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 channel_AN15 polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_channel_AN15_Tasks();
    </code>
*/
void ADC1_channel_AN15_Tasks(void);

/**
  @Summary
    ADC1 FB_P_CT2_FLT callback routine.

  @Description
    This routine is a ADC1 FB_P_CT2_FLT callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_P_CT2_FLTInterruptHandler(&ADC1_FB_P_CT2_FLT_CallBack);
    </code>
*/
void ADC1_FB_P_CT2_FLT_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 FB_P_CT2_FLT callback address.

  @Description
    This routine assigns a function pointer with a ADC1 FB_P_CT2_FLT callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_P_CT2_FLTInterruptHandler(&ADC1_FB_P_CT2_FLT_CallBack);
    </code>
*/
void ADC1_SetFB_P_CT2_FLTInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 FB_P_CT2_FLT polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_FB_P_CT2_FLT_Tasks();
    </code>
*/
void ADC1_FB_P_CT2_FLT_Tasks(void);

/**
  @Summary
    ADC1 FB_P_CT1_FLT callback routine.

  @Description
    This routine is a ADC1 FB_P_CT1_FLT callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_P_CT1_FLTInterruptHandler(&ADC1_FB_P_CT1_FLT_CallBack);
    </code>
*/
void ADC1_FB_P_CT1_FLT_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 FB_P_CT1_FLT callback address.

  @Description
    This routine assigns a function pointer with a ADC1 FB_P_CT1_FLT callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_P_CT1_FLTInterruptHandler(&ADC1_FB_P_CT1_FLT_CallBack);
    </code>
*/
void ADC1_SetFB_P_CT1_FLTInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 FB_P_CT1_FLT polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_FB_P_CT1_FLT_Tasks();
    </code>
*/
void ADC1_FB_P_CT1_FLT_Tasks(void);


/**
  @Summary
    ADC1 FB_S_CT1_FLT callback routine.

  @Description
    This routine is a ADC1 FB_S_CT1_FLT callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_S_CT1_FLTInterruptHandler(&ADC1_FB_S_CT1_FLT_CallBack);
    </code>
*/
void ADC1_FB_S_CT1_FLT_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 FB_S_CT1_FLT callback address.

  @Description
    This routine assigns a function pointer with a ADC1 FB_S_CT1_FLT callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_S_CT1_FLTInterruptHandler(&ADC1_FB_S_CT1_FLT_CallBack);
    </code>
*/
void ADC1_SetFB_S_CT1_FLTInterruptHandler(void* handler);

/**
  @Summary
    ADC1 FB_S_CT2_FLT callback routine.

  @Description
    This routine is a ADC1 FB_S_CT2_FLT callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_S_CT2_FLTInterruptHandler(&ADC1_FB_S_CT2_FLT_CallBack);
    </code>
*/
void ADC1_FB_S_CT2_FLT_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 FB_S_CT2_FLT callback address.

  @Description
    This routine assigns a function pointer with a ADC1 FB_S_CT2_FLT callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetFB_S_CT2_FLTInterruptHandler(&ADC1_FB_S_CT2_FLT_CallBack);
    </code>
*/
void ADC1_SetFB_S_CT2_FLTInterruptHandler(void* handler);



/**
  Section: Interface Routines: Dedicated Core
*/
/**
  @Summary
    Enables power for Core 0 

  @Description
    This routine is used to set the analog and digital power for ADC1 Core 0.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_Core0PowerEnable(void);

/**
  @Summary
    Enables power for Core 1 

  @Description
    This routine is used to set the analog and digital power for ADC1 Core 1.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_Core1PowerEnable(void);


/**
  @Summary
    Enables power for ADC1 shared Core

  @Description
    This routine is used to set the analog and digital power for ADC1 shared Core.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_SharedCorePowerEnable(void);



